# Taps
tap "nikitabobko/tap" # Aerospace
tap "FelixKratz/formulae" # borders

# Binaries
brew "act" # GitHub Actions runner
brew "asheshgoplani/tap/agent-deck" # Agent Deck
brew "argocd" # ArgoCD
brew "atuin" # Shell history manager
brew "bat" # cat clone with syntax highlighting
brew "btop" # Resource monitor (htop alternative)
brew "ncdu" # Disk usage analyzer with ncurses UI
brew "bitwarden-cli" # Password manager
brew "FelixKratz/formulae/borders" # borders
brew "chezmoi" # Dotfiles manager
brew "crane" # Crane
brew "coreutils" # Those that come with macOS are outdated
brew "ffmpeg" # Video/audio converter
brew "fd" # Fast directory finder
brew "fzf" # Fuzzy finder
brew "git"
brew "gh" # GitHub CLI
brew "grep"
brew "grpcurl" # gRPC client
brew "golang" # Go language
brew "htop" # Process viewer
brew "httpie" # HTTP client
brew "jq" # JSON processor
brew "k6" # Load testing tool
brew "derailed/k9s/k9s" # Kubernetes CLI
brew "kubectx" # Kubernetes context manager
brew "lazygit" # Git client
brew 'mackup' # Backup tool
brew "mise" # MiseEnPlace
brew "neovim" # Neovim
brew "ripgrep" # Fast grep (required by LazyVim)
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "sops" # Secrets manager
brew "starship" # Shell prompt
brew "terragrunt" # Terragrunt
brew "terraform-ls" # Terraform language server
brew "thefuck" # Spell corrector
brew "tflint" # Terraform linter
brew "tmux" # Terminal multiplexer
brew "tree-sitter" # Tree-sitter parser
brew "uv" # Python package manager
brew "wget" # Download tool
brew "yamlfmt" # YAML formatter
brew "yamllint" # YAML linter
brew "yq" # YAML processor
brew "z" # Smart cd command
brew "zoxide"
brew "zsh-syntax-highlighting" # Shell syntax highlighting

# Apps
cask "aerospace"
cask "betterdisplay"
cask "bluesnooze" # No more bluetooth on sleep mode
cask "bitwarden"
cask "caffeine"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "datagrip"
cask "discord"
cask "font-menlo-for-powerline"
cask "font-hack-nerd-font"
cask "freelens"
cask "ghostty"
cask "gcloud-cli"
cask "google-chrome"
cask "jordanbaird-ice"
cask "loom"
cask "orbstack"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vlc"

# VSCode extensions
# vscode "anysphere.pyright"
# vscode "charliermarsh.ruff"
# vscode "dbaeumer.vscode-eslint"
# vscode "dorzey.vscode-sqlfluff"
# vscode "eamodio.gitlens"
# vscode "esbenp.prettier-vscode"
# vscode "github.vscode-pull-request-github"
# vscode "hashicorp.terraform"
# vscode "iliazeus.vscode-ansi"
# vscode "inferrinizzard.prettier-sql-vscode"
# vscode "jcbuisson.vue"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-ceintl.vscode-language-pack-fr"
# vscode "ms-python.debugpy"
# vscode "ms-python.flake8"
# vscode "ms-python.pylint"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode.js-debug-nightly"
# vscode "ms-vscode.powershell"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "njpwerner.autodocstring"
# vscode "postman.postman-for-vscode"
# vscode "signageos.signageos-vscode-sops"
# vscode "tamasfe.even-better-toml"
# vscode "vue.vscode-typescript-vue-plugin"
# vscode "wayou.vscode-todo-highlight"
# vscode "yzane.markdown-pdf"
