# Taps
tap "nikitabobko/tap" # Aerospace

# Binaries
brew "act" # GitHub Actions runner
brew "argocd" # ArgoCD
brew "bat" # cat clone with syntax highlighting
brew "bitwarden-cli" # Password manager
brew "chezmoi" # Dotfiles manager
brew "coreutils" # Those that come with macOS are outdated
brew "ffmpeg" # Video/audio converter
brew "fzf" # Fuzzy finder
brew "git"
brew "grep"
brew "htop" # Process viewer
brew "jq" # JSON processor
brew "k6" # Load testing tool
brew "lazygit" # Git client
brew 'mackup' # Backup tool
brew "mise" # MiseEnPlace
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "sops" # Secrets manager
brew "starship" # Shell prompt
brew "terragrunt" # Terragrunt
brew "thefuck" # Spell corrector
brew "tmux" # Terminal multiplexer
brew "wget" # Download tool
brew "yamlfmt" # YAML formatter
brew "yamllint" # YAML linter
brew "yq" # YAML processor
brew "z" # Smart cd command
brew "zsh-syntax-highlighting" # Shell syntax highlighting

# Apps
cask "aerospace"
cask "bitwarden"
cask "caffeine"
cask "chatgpt"
cask "cursor"
cask "datagrip"
cask "discord"
cask "font-menlo-for-powerline"
cask "font-hack-nerd-font"
cask "freelens"
cask "ghostty"
cask "google-cloud-sdk"
cask "google-chrome"
cask "hiddenbar"
cask "jordanbaird-ice"
cask "loom"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vlc"

# VSCode extensions
vscode "anysphere.pyright"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "dorzey.vscode-sqlfluff"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "iliazeus.vscode-ansi"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jcbuisson.vue"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "signageos.signageos-vscode-sops"
vscode "tamasfe.even-better-toml"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "yzane.markdown-pdf"
